app/views/reservations/_index.html.erb

  <tbody>
    <% @table.reservations.each do |reservation| next if reservation.id.nil? %>
---
SELECT "reservations".* FROM "reservations" WHERE "reservations"."table_id" = ?  [["table_id", 3]]