app/views/tables/_index.html.erb

SELECT "tables".* FROM "tables" WHERE "tables"."restaurant_id" = ?  [["restaurant_id", 1]]
---

<% @restaurant.tables.each do |table| %>