app/controllers/reservations_controller.rb

SELECT  "tables".* FROM "tables" WHERE "tables"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "reservations" ("start", "duration", "user", "table_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["start", "2019-08-04 16:30:00"], ["duration", 30], ["user", "Petro"], ["table_id", 1], ["created_at", "2019-08-04 13:30:20.862940"], ["updated_at", "2019-08-04 13:30:20.862940"]]
---
  def create
    @table = Table.find(params[:table_id])
    @reservation = @table.reservations.new(reservation_params)

    respond_to do |format|
      if @reservation.save

DELETE FROM "reservations" WHERE "reservations"."id" = ?  [["id", 4]]
---
  def destroy
    @reservation.destroy

SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_reservation
    @reservation = Reservation.find(params[:id])