app/controllers/restaurants_controller.rb

  def create
    @restaurant = Restaurant.new(restaurant_params)

    respond_to do |format|
      if @restaurant.save
---
INSERT INTO "restaurants" ("title", "start_time", "end_time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Bingo"], ["start_time", "2000-01-01 10:00:00"], ["end_time", "2000-01-01 01:00:00"], ["created_at", "2019-08-04 12:29:13.291435"], ["updated_at", "2019-08-04 12:29:13.291435"]]

  def update
    respond_to do |format|
      if @restaurant.update(restaurant_params)
---
UPDATE "restaurants" SET "end_time" = ?, "updated_at" = ? WHERE "restaurants"."id" = ?  [["end_time", "2000-01-01 02:00:00"], ["updated_at", "2019-08-04 14:00:08.930138"], ["id", 1]]

  def destroy
    @restaurant.destroy
---
DELETE FROM "restaurants" WHERE "restaurants"."id" = ?  [["id", 2]]

  def set_restaurant
    @restaurant = Restaurant.find(params[:id])
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]