app/controllers/tables_controller.rb

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "tables" ("number", "restaurant_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["number", 1], ["restaurant_id", 1], ["created_at", "2019-08-04 12:57:23.369597"], ["updated_at", "2019-08-04 12:57:23.369597"]]
---
  def create
    @restaurant = Restaurant.find(params[:restaurant_id])
    @table = @restaurant.tables.new(table_params)

    respond_to do |format|
      if @table.save

UPDATE "tables" SET "number" = ?, "updated_at" = ? WHERE "tables"."id" = ?  [["number", 3], ["updated_at", "2019-08-04 13:59:20.429919"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @table.update(table_params)

DELETE FROM "tables" WHERE "tables"."id" = ?  [["id", 3]]
---
  def destroy
    @table.destroy

SELECT  "tables".* FROM "tables" WHERE "tables"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_table
    @table = Table.find(params[:id])