app/models/reservation.rb

  def unique_reservation
    reservations = Reservation.where(table_id: table_id)
    date_ranges = reservations.map { |b| b.start...(b.start + b.duration * 60) }
---
SELECT "reservations".* FROM "reservations" WHERE "reservations"."table_id" = ?  [["table_id", 1]]